calidad/PDI_Prjct/src/test/resources/reqDescargaMTOMRuteadorNoDP.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:des="http://servicios.pge.red.uy/agesic/artee/DescargarExpediente">
  <Header xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <MessageID xmlns="http://www.w3.org/2005/08/addressing">uuid:c9a6a0bd-bb9d-451f-95f5-c178dd0a33c4</MessageID>
    <Action xmlns="http://www.w3.org/2005/08/addressing">http://servicios.pge.red.uy/agesic/artee/DescargarExpediente/ServicioDescargarExpediente/DescargarExpediente</Action>
    <wsa:ReplyTo xmlns="" xmlns:wsa="http://www.w3.org/2005/08/addressing">
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
    </wsa:ReplyTo>
    <a:To xmlns="" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:e="http://schemas.xmlsoap.org/soap/envelope/" xmlns:a="http://www.w3.org/2005/08/addressing">http://servicios.pge.red.uy/artee/DescargarExpediente/prueba2</a:To>
    <wsse:Security xmlns="" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:actor="agesic">
      <saml:Assertion xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion" AssertionID="Assertion-uuid35a709a-0160-1014-92ee-96281d8c4221" IssueInstant="2017-11-28T15:59:06Z" Issuer="Urudata" MajorVersion="1" MinorVersion="1">
        <saml:Conditions NotBefore="2017-11-28T15:44:05Z" NotOnOrAfter="2017-11-28T16:14:07Z">
          <saml:AudienceRestrictionCondition>
            <saml:Audience>http://testservicios.pge.red.uy/testPDI/testmockmtom</saml:Audience>
          </saml:AudienceRestrictionCondition>
        </saml:Conditions>
        <saml:AuthenticationStatement AuthenticationInstant="2017-11-28T15:59:06Z" AuthenticationMethod="urn:oasis:names:tc:SAML:1.0:am:password">
          <saml:Subject>
            <saml:NameIdentifier>ou=gerencia de proyectos,o=agesic,o=presidencia de la republica,O=Poder Ejecutivo,O=Gobierno Nacional,o=Gobierno,C=UY</saml:NameIdentifier>
          </saml:Subject>
        </saml:AuthenticationStatement>
        <saml:AttributeStatement>
          <saml:Subject>
            <saml:NameIdentifier>ou=gerencia de proyectos,o=agesic,o=presidencia de la republica,O=Poder Ejecutivo,O=Gobierno Nacional,o=Gobierno,C=UY</saml:NameIdentifier>
          </saml:Subject>
          <saml:Attribute AttributeName="User" AttributeNamespace="urn:tokensimple">
            <saml:AttributeValue>agesic</saml:AttributeValue>
          </saml:Attribute>
        </saml:AttributeStatement>
        <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="uuid35a709b-0160-1127-9885-96281d8c4221">
          <ds:SignedInfo>
            <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
            <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
            <ds:Reference URI="#Assertion-uuid35a709a-0160-1014-92ee-96281d8c4221">
              <ds:Transforms>
                <ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                  <xc14n:InclusiveNamespaces xmlns:xc14n="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="saml"/>
                </ds:Transform>
              </ds:Transforms>
              <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
              <ds:DigestValue>SHKQB1UtwZXlGp/cziVvwJZ4IqA=</ds:DigestValue>
            </ds:Reference>
          </ds:SignedInfo>
          <ds:SignatureValue>bcQvrshGCnAVls6zh9eqXFPREWWFl7aPRpR7yQTlLAcnpB9zMOxqpXzTMGYvTJGSVQGcJttcWW8015FeJElbJRHJylVf440qarZGunAng0LGOsS/h1PXMjbrac85r6BEfVbImn8gqVqCd8WQyG+BFviNqDzR1U7aXhnIYOf9FHA=</ds:SignatureValue>
          <ds:KeyInfo>
            <ds:X509Data>
              <ds:X509Certificate>MIICBzCCAXCgAwIBAgIEQH26vjANBgkqhkiG9w0BAQQFADBIMQswCQYDVQQGEwJVUzEPMA0GA1UEChMGVGl2b2xpMQ4wDAYDVQQLEwVUQU1lQjEYMBYGA1UEAxMPZmltZGVtby5pYm0uY29tMB4XDTA0MDQxNDIyMjcxMFoXDTE3MTIyMjIyMjcxMFowSDELMAkGA1UEBhMCVVMxDzANBgNVBAoTBlRpdm9saTEOMAwGA1UECxMFVEFNZUIxGDAWBgNVBAMTD2ZpbWRlbW8uaWJtLmNvbTCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAiZ0D1X6rk8+ZwNBTVZt7C85m421a8A52Ksjw40t+jNvbLYDp/W66AMMYD7rB5qgniZ5K1p9W8ivM9WbPxc2u/60tFPg0e/Q/r/fxegW1K1umnay+5MaUvN3p4XUCRrfg79OvurvXQ7GZa1/wOp5vBIdXzg6i9CVAqL29JGi6GYUCAwEAATANBgkqhkiG9w0BAQQFAAOBgQBXiAhxm91I4m+g3YX+dyGc352TSKO8HvAIBkHHFFwIkzhNgO+zLhxg5UMkOg12X9ucW7leZ1IB0Z6+JXBrXIWmU3UPum+QxmlaE0OG9zhp9LEfzsE5+ff+7XpS0wpJklY6c+cqHj4aTGfOhSE6u7BLdI26cZNdzxdhikBMZPgdyQ==</ds:X509Certificate>
            </ds:X509Data>
          </ds:KeyInfo>
        </ds:Signature>
      </saml:Assertion>
    </wsse:Security>
  </Header>
  <soapenv:Body>
    <des:DescargarExpedienteIn>
      <des:DominioOrigen>test_descarga.expediente.red.uy</des:DominioOrigen>
      <des:Subdominio>mesaentrada</des:Subdominio>
    </des:DescargarExpedienteIn>
  </soapenv:Body>
</soapenv:Envelope>